"""
Условие
Дана строка, состоящая из слов, разделенных пробелами.
Определите, сколько в ней слов. Используйте для решения задачи метод count.
"""


print(len(input().split()))

#  print(input().count(' ') + 1)

