"""
Условие
Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.
"""


print(int(input()) + int(input()) + int(input()))
